# TotalQuantity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalLoadSet..::..TotalQuantity Property
ElectricalAnalyticalLoadSet Class See Also
---
The total count of the Equipment Loads in the LoadSet.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int TotalQuantity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalQuantity As Integer
	Get
```

Visual C++
---
```text
public:
property int TotalQuantity {
	int get ();
}
```

# See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace